# Chapter 5

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

## 5.1   Introduction to pandas Data Sctructures

### Series

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
print(obj.values)
print(obj.index)

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [4]:
obj2 = pd.Series([4, 7, -5, 3], index = ["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [5]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [6]:
obj2["a"]

-5

In [7]:
obj2["d"] = 6
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [8]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [9]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [10]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be used in many contexts where you might use a dict:

In [11]:
print("b" in obj2)
print("e" in obj2)

True
False

Should you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [12]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [13]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Here, three values found in `sdata` were placed in the appropriate locations, but since no value for `'California'` was found, it appears as `NaN` (not a number), which is considered in pandas to mark missing or *NA* values. Since `'Utah'` was not included in states, it is excluded from the resulting object.

The `isnull` and `notnull` functions in pandas should be used to detect missing data:

In [14]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [15]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

Series also has these as instance methods:

In [16]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations:

In [17]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both the Series object itself and its index have a name attribute, which integrates with other key areas of pandas functionality:

In [18]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A Series’s index can be altered in-place by assignment:

In [19]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [20]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

The DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing the same index. Under the hood, the data is stored as one or more two-dimensional blocks rather than a list, dict, or some other collection of one-dimensional arrays.

In [21]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"], 
        "year": [2000, 2001, 2002, 2001, 2002, 2003], 
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [22]:
frame.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [23]:
pd.DataFrame(data, columns = ["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [24]:
frame2 = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"], 
                      index = ["one", "two", "three", "four", "five", "six"])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [25]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [26]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [27]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

Attribute-like access (e.g., `frame2.year`) and tab completion of column names in IPython is provided as a convenience.    
`frame2[column]` works for any column name, but `frame2.column` only works when the column name is a valid Python variable name.

In [28]:
frame2.loc["three"]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [29]:
frame2["debt"] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [30]:
frame2["debt"] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any holes:

In [31]:
val = pd.Series([-1.2, -1.5, -1.7], index = ["two", "four", "five"])
frame2["debt"] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [32]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

New columns cannot be created with the `frame2.eastern` syntax.

The `del` method can then be used to remove this column:

In [33]:
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

The column returned from indexing a DataFrame is a *view* on the underlying data, not a copy. Thus, any in-place modifications to the Series will be reflected in the DataFrame. The column can be explicitly copied with the Series’s `copy` method.

Another common form of data is a nested dict of dicts:

In [34]:
pop = {"Nevada": {2001: 2.4, 2002: 2.9}, 
       "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}}

If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys as the columns and the inner keys as the row indices:

In [35]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [36]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

The keys in the inner dicts are combined and sorted to form the index in the result. This isn’t true if an explicit index is specified:

In [37]:
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

Dicts of Series are treated in much the same way:

In [38]:
pdata = {"Ohio": frame3["Ohio"][:-1], 
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

If a DataFrame’s `index` and `columns` have their `name` attributes set, these will also be displayed:

In [39]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

As with Series, the `values` attribute returns the data contained in the DataFrame as a two-dimensional ndarray:

In [40]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

If the DataFrame’s columns are different dtypes, the dtype of the values array will be chosen to accommodate all of the columns:

In [41]:
frame2.values.dtype

dtype('O')

### Index Objects

In [42]:
obj = pd.Series(range(3), index = ["a", "b", "c"])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

Index objects are immutable and thus can’t be modified by the user.

Immutability makes it safer to share Index objects among data structures:

In [43]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [44]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [45]:
obj2.index is labels

True

In [46]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [47]:
"Ohio" in frame3.columns

True

In [48]:
2003 in frame3.index

False

Unlike Python sets, a pandas Index can contain duplicate labels:

In [49]:
dup_labels = pd.Index(["foo", "foo", "bar", "bar"])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

Selections with duplicate labels will select all occurrences of that label.

## 5.2   Essential Functionality

### Reindexing

In [50]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [51]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a method such as `ffill`, which forward-fills the values:

In [52]:
obj3 = pd.Series(["blue", "purple", "yellow"], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [53]:
obj3.reindex(np.arange(6), method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, `reindex` can alter either the (row) index, columns, or both. When passed only a sequence, it reindexes the rows in the result:

In [54]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                     index = ["a", "c", "d"], 
                     columns = ["Ohio", "Texas", "California"])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [55]:
frame2 = frame.reindex(["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

The columns can be reindexed with the `columns` keyword:

In [56]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [57]:
frame.loc[["a", "c"], ["Texas", "California"]]

   Texas  California
a      1           2
c      4           5

### Dropping Entries from an Axis

In [58]:
obj = pd.Series(np.arange(5.), index = ["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [59]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [60]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [61]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                    index = ["Ohio", "Colorado", "Utah", "New York"], 
                    columns = ["one", "two", "three", "four"])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
data.drop(["one", "three"], axis = 1)

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [64]:
data.drop("two", axis = "columns")

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

Many functions, like drop, which modify the size or shape of a Series or DataFrame, can manipulate an object *in-place* without returning a new object:

In [65]:
obj.drop("c", inplace = True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selecting, and Filtering

In [66]:
obj = pd.Series(np.arange(4.), index = ["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [67]:
obj["b"]

1.0

In [68]:
obj[1]

1.0

In [69]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [70]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [71]:
obj[[2, 1]]

c    2.0
b    1.0
dtype: float64

In [72]:
obj[obj % 2 == 0]

a    0.0
c    2.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the end‐point is inclusive:

In [73]:
obj["b":"c"]

b    1.0
c    2.0
dtype: float64

*Setting* using these methods modifies the corresponding section of the Series:

In [74]:
obj["b":"c"] = 5.0
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequence:

In [75]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [76]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

Indexing like this has a few special cases. First, slicing or selecting data with a boolean array:

In [77]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [78]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The row selection syntax `data[:2]` is provided as a convenience. Passing a single element or a list to the `[]` operator selects columns.

In [79]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [80]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc

For DataFrame label-indexing on the rows, I introduce the special indexing operators `loc` and `iloc`. They enable you to select a subset of the rows and columns from a DataFrame with NumPy-like notation using either axis labels (`loc`) or integers (`iloc`).

In [81]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [82]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [83]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [84]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [85]:
print(data.iloc[:, :3])
print(data.iloc[:, :3][data.three > 5])

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14
          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes

In [86]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [87]:
# ser[-1]
# Error is raised

In this case, pandas could “fall back” on integer indexing, but it’s difficult to do this in general without introducing subtle bugs. Here we have an index containing 0, 1, 2, but inferring what the user wants (label-based indexing or position-based) is difficult.

On the other hand, with a non-integer index, there is no potential for ambiguity:

In [88]:
ser2 = pd.Series(np.arange(3.), index = ["a", "b", "c"])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [89]:
ser2[-1]

2.0

To keep things consistent, if you have an axis index containing integers, data selection will always be label-oriented. For more precise handling, use `loc` (for labels) or `iloc` (for integers):

In [90]:
ser[:1]

0    0.0
dtype: float64

In [91]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [92]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [93]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ["a", "c", "d", "e"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [94]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ["a", "c", "e", "f", "g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [95]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [96]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns = list("bcd"), 
                   index = ["Ohio", "Colorado", "Texas"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Colorado  3.0  4.0  5.0
Texas     6.0  7.0  8.0

In [97]:
df2 = pd.DataFrame(np.arange(12.).reshape(4, 3), 
                   columns = list("bce"), 
                   index = ["Utah", "Ohio", "Texas", "Oregon"])
df2

          b     c     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [98]:
df1 + df2

             b     c   d   e
Colorado   NaN   NaN NaN NaN
Ohio       3.0   5.0 NaN NaN
Oregon     NaN   NaN NaN NaN
Texas     12.0  14.0 NaN NaN
Utah       NaN   NaN NaN NaN

In [99]:
df1 = pd.DataFrame({"A": [1, 2]})
df1

   A
0  1
1  2

In [100]:
df2 = pd.DataFrame({"B": [3, 4]})
df2

   B
0  3
1  4

In [101]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [102]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns = list("abcd"))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [103]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns = list("abcde"))
df2.loc[1, "b"] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [104]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [105]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Each of the arithmetic methods has a counterpart, starting with the letter `r`, that has arguments flipped. So these two statements are equivalent:

In [106]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [107]:
df1.rdiv(2)

      a         b         c         d
0   inf  2.000000  1.000000  0.666667
1  0.50  0.400000  0.333333  0.285714
2  0.25  0.222222  0.200000  0.181818

Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill value:

In [108]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [109]:
frame = pd.DataFrame(np.arange(12.).reshape(4, 3), 
                     columns = list("bde"), 
                     index = ["Utah", "Ohio", "Texas", "Oregon"])

frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [110]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [111]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [112]:
series2 = pd.Series(np.arange(3.), index = list("bef"))
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to use one of the arithmetic methods. For example:

In [113]:
series3 = frame["d"]
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [114]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [115]:
frame.sub(series3, axis = "index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

The axis number that you pass is the *axis to match on*. In this case we mean to match on the DataFrame’s row index (`axis='index'` or `axis=0`) and broadcast across.

### Function Application and Mapping

In [116]:
frame = pd.DataFrame(np.random.randn(4, 3), 
                     columns = list("bde"), 
                     index = ["Utah", "Ohio", "Texas", "Oregon"])

frame

               b         d         e
Utah    0.430830  0.447660 -0.016538
Ohio    0.857458  1.702540 -1.601676
Texas  -0.021981  0.323736 -0.213248
Oregon  0.806198 -0.577661  0.079123

In [117]:
np.abs(frame)

               b         d         e
Utah    0.430830  0.447660  0.016538
Ohio    0.857458  1.702540  1.601676
Texas   0.021981  0.323736  0.213248
Oregon  0.806198  0.577661  0.079123

Another frequent operation is applying a function on one-dimensional arrays to each column or row. DataFrame’s `apply` method does exactly this:

In [118]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    0.879439
d    2.280201
e    1.680799
dtype: float64

Here the function `f`, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in `frame`. The result is a Series having the columns of `frame` as its index.

If you pass `axis='columns'` to `apply`, the function will be invoked once per row instead:

In [119]:
frame.apply(f, axis = "columns")

Utah      0.464197
Ohio      3.304216
Texas     0.536985
Oregon    1.383859
dtype: float64

Many of the most common array statistics (like `sum` and `mean`) are DataFrame methods, so using `apply` is not necessary.

The function passed to `apply` need not return a scalar value; it can also return a Series with multiple values:

In [120]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ["min", "max"])

frame.apply(f)

            b         d         e
min -0.021981 -0.577661 -1.601676
max  0.857458  1.702540  0.079123

Element-wise Python functions can be used, too. Suppose you wanted to compute a formatted string from each floating-point value in `frame`. You can do this with `applymap`:

In [121]:
num_format = lambda x: "%.2f" % x
frame.applymap(num_format)

            b      d      e
Utah     0.43   0.45  -0.02
Ohio     0.86   1.70  -1.60
Texas   -0.02   0.32  -0.21
Oregon   0.81  -0.58   0.08

The reason for the name `applymap` is that Series has a `map` method for applying an element-wise function:

In [122]:
frame["e"].map(num_format)

Utah      -0.02
Ohio      -1.60
Texas     -0.21
Oregon     0.08
Name: e, dtype: object

### Sorting and Ranking

In [123]:
obj = pd.Series(range(4), index = ["d", "a", "b", "c"])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [124]:
frame = pd.DataFrame(np.arange(8.).reshape((2, 4)), 
                     index = ["three", "one"], 
                     columns = ["d", "a", "b", "c"])

frame.sort_index()

         d    a    b    c
one    4.0  5.0  6.0  7.0
three  0.0  1.0  2.0  3.0

In [125]:
frame.sort_index(axis = 1)

         a    b    c    d
three  1.0  2.0  3.0  0.0
one    5.0  6.0  7.0  4.0

In [126]:
frame.sort_index(axis = 1, ascending = False)

         d    c    b    a
three  0.0  3.0  2.0  1.0
one    4.0  7.0  6.0  5.0

In [127]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [128]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort keys. To do so, pass one or more column names to the by option of `sort_values`:

In [129]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [130]:
frame.sort_values(by = "b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [131]:
frame.sort_values(by = ["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

*Ranking* assigns ranks from one through the number of valid data points in an array. The `rank` methods for Series and DataFrame are the place to look; by default `rank` breaks ties by assigning each group the mean rank:

In [132]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the data:

In [133]:
obj.rank(method = "first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [134]:
obj.rank(method = "max", ascending = False)

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [135]:
obj.rank(method = "min", ascending = False)

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [136]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1], "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [137]:
frame.rank(axis = "columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [138]:
obj = pd.Series(range(5), index = ["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index’s `is_unique` property can tell you whether its labels are unique or not:

In [139]:
obj.index.is_unique

False

In [140]:
obj["a"]

a    0
a    1
dtype: int64

In [141]:
obj["c"]

4

In [142]:
df = pd.DataFrame(np.random.randn(4, 3), index = ["a", "a", "b", "b"])
df

          0         1         2
a  0.058434 -1.521489 -0.336984
a -0.602537 -0.608175 -2.121638
b  0.401033 -0.244365 -2.417843
b -0.048700 -0.797050  0.992415

In [143]:
df.loc["a"]

          0         1         2
a  0.058434 -1.521489 -0.336984
a -0.602537 -0.608175 -2.121638

## 5.3   Summarizing and Computing Descriptive Statistics

In [144]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], 
                  index = ["a", "b", "c", "d"], 
                 columns = ["one", "two"])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [145]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [146]:
df.sum(axis = "columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are excluded unless the entire slice (row or column in this case) is NA. This can be disabled with the `skipna` option:

In [147]:
df.sum(axis = "columns", skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

Some methods, like `idxmin` and `idxmax`, return indirect statistics like the index value where the minimum or maximum values are attained:

In [148]:
df.idxmax()

one    b
two    d
dtype: object

In [149]:
df.idxmin()

one    d
two    b
dtype: object

Other methods are *accumulations*:

In [150]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Another type of method is neither a reduction nor an accumulation. `describe` is one such example, producing multiple summary statistics in one shot:

In [151]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

On non-numeric data, `describe` produces alternative summary statistics:

In [152]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [166]:
df = pd.DataFrame(np.random.randn(10, 3), columns = ["a", "b", "c"])
df

          a         b         c
0 -0.080526  0.651363 -1.296283
1 -1.001863  0.236088 -0.259069
2  1.054847  0.394136  0.725508
3 -0.787448 -0.613001 -0.046560
4 -0.703216 -0.132516  0.262497
5  0.018797 -0.929629  0.351440
6  0.038506 -0.127681  1.582968
7  0.238740  0.010387 -1.586570
8  1.228192  0.528345 -1.628707
9  0.585985 -0.215426  0.606404

In [167]:
pct = df.pct_change()
pct.tail()

          a          b         c
5 -1.026731   6.015237  0.338835
6  1.048477  -0.862654  3.504233
7  5.200082  -1.081351 -2.002276
8  4.144481  49.865991  0.026558
9 -0.522888  -1.407737 -1.372323

In [168]:
print("Correlation: %f" % pct["a"].corr(pct["b"]))
print("Covariance: %f" % pct["a"].cov(pct["c"]))

Correlation: 0.170434
Covariance: 2.055670

In [169]:
pct.a.corr(pct.b)

0.17043401718132586

DataFrame’s `corr` and `cov` methods, on the other hand, return a full correlation or covariance matrix as a DataFrame, respectively:

In [170]:
pct.corr()

          a         b         c
a  1.000000  0.170434  0.166312
b  0.170434  1.000000  0.198148
c  0.166312  0.198148  1.000000

Using DataFrame’s `corrwith` method, you can compute pairwise correlations between a DataFrame’s columns or rows with another Series or DataFrame. Passing a Series returns a Series with the correlation value computed for each column:

In [171]:
pct.corrwith(pct.a)

a    1.000000
b    0.170434
c    0.166312
dtype: float64

Passing `axis='columns'` does things row-by-row instead. In all cases, the data points are aligned by label before the correlation is computed.

### Unique Values, Value Counts, and Membership

In [174]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [176]:
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [177]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [178]:
pd.value_counts(obj.values, sort = False)

c    3
a    3
d    1
b    2
dtype: int64

`isin` performs a vectorized set membership check and can be useful in filtering a dataset down to a subset of values in a Series or column in a DataFrame:

In [179]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [180]:
mask = obj.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [181]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

Related to `isin` is the `Index.get_indexer` method, which gives you an index array from an array of possibly non-distinct values into another array of distinct values:

In [182]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In some cases, you may want to compute a histogram on multiple related columns in a DataFrame. Here’s an example:

In [183]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4], "Qu2": [2, 3, 1, 2, 3], "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [184]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0